[Killed] ConditionalExpression
src/github.js:22:9
   async getTags() {
     const cacheKey = 'tags';
     const cached = this.getFromCache(cacheKey);
-    if (cached) return cached;
+    if (true) return cached;
 
     try {
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getTags should return empty array on error
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/github.js:22:9
   async getTags() {
     const cacheKey = 'tags';
     const cached = this.getFromCache(cacheKey);
-    if (cached) return cached;
+    if (false) return cached;
 
     try {

[Killed] BlockStatement
src/github.js:24:9
     const cached = this.getFromCache(cacheKey);
     if (cached) return cached;
 
-    try {
-      const response = await fetch(`${GITHUB_API_BASE}/repos/${REPO_OWNER}/${REPO_NAME}/tags`, {
-        headers: {
-          'Accept': 'application/vnd.github.v3+json',
-          'User-Agent': 'vcluster-yaml-mcp-server'
-        }
-      });
-
-      if (!response.ok) {
-        throw new Error(`GitHub API error: ${response.statusText}`);
-      }
-
-      const tags = await response.json();
-      const tagNames = tags.map(tag => tag.name);
-      
-      this.setCache(cacheKey, tagNames);
-      return tagNames;
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching tags:', error);
       return [];
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getTags should return empty array on error
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/github.js:32:25
         }
       });
 
-      if (!response.ok) {
-        throw new Error(`GitHub API error: ${response.statusText}`);
-      }
+      if (!response.ok) {}
 
       const tags = await response.json();

[NoCoverage] ArrowFunction
src/github.js:37:33
       }
 
       const tags = await response.json();
-      const tagNames = tags.map(tag => tag.name);
+      const tagNames = tags.map(() => undefined);
       
       this.setCache(cacheKey, tagNames);

[Killed] BlockStatement
src/github.js:41:21
       
       this.setCache(cacheKey, tagNames);
       return tagNames;
-    } catch (error) {
-      console.error('Error fetching tags:', error);
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getTags should return empty array on error
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/github.js:42:21
       this.setCache(cacheKey, tagNames);
       return tagNames;
     } catch (error) {
-      console.error('Error fetching tags:', error);
+      console.error("", error);
       return [];
     }

[Survived] ArrayDeclaration
src/github.js:43:14
       return tagNames;
     } catch (error) {
       console.error('Error fetching tags:', error);
-      return [];
+      return ["Stryker was here"];
     }
   }

[Killed] BlockStatement
src/github.js:53:9
     const cached = this.getFromCache(cacheKey);
     if (cached) return cached;
 
-    try {
-      const response = await fetch(`${GITHUB_API_BASE}/repos/${REPO_OWNER}/${REPO_NAME}/branches`, {
-        headers: {
-          'Accept': 'application/vnd.github.v3+json',
-          'User-Agent': 'vcluster-yaml-mcp-server'
-        }
-      });
-
-      if (!response.ok) {
-        throw new Error(`GitHub API error: ${response.statusText}`);
-      }
-
-      const branches = await response.json();
-      const branchNames = branches.map(branch => branch.name);
-      
-      this.setCache(cacheKey, branchNames);
-      return branchNames;
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching branches:', error);
       return ['main'];
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getBranches should return [main] on error
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/github.js:57:25
       const response = await fetch(`${GITHUB_API_BASE}/repos/${REPO_OWNER}/${REPO_NAME}/branches`, {
         headers: {
           'Accept': 'application/vnd.github.v3+json',
-          'User-Agent': 'vcluster-yaml-mcp-server'
+          'User-Agent': ""
         }
       });

[NoCoverage] ArrowFunction
src/github.js:66:40
       }
 
       const branches = await response.json();
-      const branchNames = branches.map(branch => branch.name);
+      const branchNames = branches.map(() => undefined);
       
       this.setCache(cacheKey, branchNames);

[Killed] BlockStatement
src/github.js:70:21
       
       this.setCache(cacheKey, branchNames);
       return branchNames;
-    } catch (error) {
-      console.error('Error fetching branches:', error);
-      return ['main'];
-    }
+    } catch (error) {}
   }
 
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getBranches should return [main] on error
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/github.js:72:14
       return branchNames;
     } catch (error) {
       console.error('Error fetching branches:', error);
-      return ['main'];
+      return [];
     }
   }
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling QUIRK: getBranches should return [main] on error
statusReason: expected [] to include 'main'

[Killed] LogicalOperator
src/github.js:79:9
   // Get file content from GitHub
   async getFileContent(path, ref = 'main') {
     // Validate path - prevent path traversal
-    if (path.includes('..') || path.startsWith('/')) {
+    if (path.includes('..') && path.startsWith('/')) {
       throw new Error('Invalid path: path traversal not allowed');
     }
killedBy: github.js - Security Edge Cases and Quirks SECURITY: Path Traversal Attacks should reject path with .. (parent directory)
statusReason: expected [Function] to throw error including 'path traversal not allowed' but got 'Failed to fetch ../etc/passwd: File n…'

[Killed] ConditionalExpression
src/github.js:79:9
   // Get file content from GitHub
   async getFileContent(path, ref = 'main') {
     // Validate path - prevent path traversal
-    if (path.includes('..') || path.startsWith('/')) {
+    if (false) {
       throw new Error('Invalid path: path traversal not allowed');
     }
killedBy: github.js - Security Edge Cases and Quirks SECURITY: Path Traversal Attacks should reject path with .. (parent directory)
statusReason: expected [Function] to throw error including 'path traversal not allowed' but got 'Failed to fetch ../etc/passwd: File n…'

[Killed] ConditionalExpression
src/github.js:84:9
     }
 
     // Validate ref format (branch, tag, or commit SHA)
-    if (!/^[\w.\/-]+$/.test(ref)) {
+    if (true) {
       throw new Error('Invalid ref format');
     }
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling should provide helpful error message for 404
statusReason: expected 'Invalid ref format' to contain 'does-not-exist.yaml'

[Killed] BooleanLiteral
src/github.js:84:9
     }
 
     // Validate ref format (branch, tag, or commit SHA)
-    if (!/^[\w.\/-]+$/.test(ref)) {
+    if (/^[\w.\/-]+$/.test(ref)) {
       throw new Error('Invalid ref format');
     }
killedBy: github.js - Security Edge Cases and Quirks SECURITY: Ref Format Validation should reject ref with special characters (potential injection)
statusReason: expected [Function] to throw error including 'Invalid ref format' but got 'Failed to fetch chart/values.yaml: Fi…'

[Killed] StringLiteral
src/github.js:89:22
     }
 
     const actualRef = ref;
-    const cacheKey = `file:${actualRef}:${path}`;
+    const cacheKey = ``;
     const cached = this.getFromCache(cacheKey);
     if (cached) return cached;
killedBy: Tool Implementations create-vcluster-config tool should create and validate a valid config
statusReason: expected '❌ **Failed to validate configuration*…' to contain '✅'

[Killed] BlockStatement
src/github.js:93:9
     const cached = this.getFromCache(cacheKey);
     if (cached) return cached;
 
-    try {
-      const url = `${GITHUB_RAW_BASE}/${REPO_OWNER}/${REPO_NAME}/${actualRef}/${path}`;
-      const response = await fetch(url, {
-        headers: {
-          'User-Agent': 'vcluster-yaml-mcp-server'
-        }
-      });
-
-      if (!response.ok) {
-        if (response.status === 404) {
-          throw new Error(`File not found: ${path} (ref: ${actualRef})`);
-        }
-        throw new Error(`GitHub error: ${response.statusText}`);
-      }
-
-      const content = await response.text();
-      this.setCache(cacheKey, content);
-      return content;
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(`Failed to fetch ${path}: ${error.message}`);
     }
killedBy: Tool Implementations create-vcluster-config tool should create and validate a valid config
statusReason: expected '❌ **Failed to validate configuration*…' to contain '✅'

[Survived] ObjectLiteral
src/github.js:96:18
     try {
       const url = `${GITHUB_RAW_BASE}/${REPO_OWNER}/${REPO_NAME}/${actualRef}/${path}`;
       const response = await fetch(url, {
-        headers: {
-          'User-Agent': 'vcluster-yaml-mcp-server'
-        }
+        headers: {}
       });
 

[Survived] EqualityOperator
src/github.js:102:13
       });
 
       if (!response.ok) {
-        if (response.status === 404) {
+        if (response.status !== 404) {
           throw new Error(`File not found: ${path} (ref: ${actualRef})`);
         }

[Survived] ConditionalExpression
src/github.js:102:13
       });
 
       if (!response.ok) {
-        if (response.status === 404) {
+        if (true) {
           throw new Error(`File not found: ${path} (ref: ${actualRef})`);
         }

[Killed] BlockStatement
src/github.js:111:21
       const content = await response.text();
       this.setCache(cacheKey, content);
       return content;
-    } catch (error) {
-      throw new Error(`Failed to fetch ${path}: ${error.message}`);
-    }
+    } catch (error) {}
   }
 
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling should handle network errors gracefully
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/github.js:112:23
       this.setCache(cacheKey, content);
       return content;
     } catch (error) {
-      throw new Error(`Failed to fetch ${path}: ${error.message}`);
+      throw new Error(``);
     }
   }
killedBy: github.js - Security Edge Cases and Quirks EDGE CASE: Error Handling should provide helpful error message for 404
statusReason: expected '' to contain 'does-not-exist.yaml'

[Killed] BlockStatement
src/github.js:117:42
   }
 
   // Get parsed YAML content
-  async getYamlContent(path, ref = null) {
-    const content = await this.getFileContent(path, ref);
-    try {
-      return yaml.load(content);
-    } catch (error) {
-      throw new Error(`Failed to parse YAML from ${path}: ${error.message}`);
-    }
-  }
+  async getYamlContent(path, ref = null) {}
 
   // Get vcluster configuration files
killedBy: Smart Query Feature Result Formatting should show result count
statusReason: expected 'No matches found for "enabled" in cha…' to match /Found \d+ match(es)?/

[Killed] BlockStatement
src/github.js:119:9
   // Get parsed YAML content
   async getYamlContent(path, ref = null) {
     const content = await this.getFileContent(path, ref);
-    try {
-      return yaml.load(content);
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(`Failed to parse YAML from ${path}: ${error.message}`);
     }
killedBy: Smart Query Feature Result Formatting should show result count
statusReason: expected 'No matches found for "enabled" in cha…' to match /Found \d+ match(es)?/

[NoCoverage] BlockStatement
src/github.js:121:21
     const content = await this.getFileContent(path, ref);
     try {
       return yaml.load(content);
-    } catch (error) {
-      throw new Error(`Failed to parse YAML from ${path}: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/github.js:122:23
     try {
       return yaml.load(content);
     } catch (error) {
-      throw new Error(`Failed to parse YAML from ${path}: ${error.message}`);
+      throw new Error(``);
     }
   }

[Survived] BlockStatement
src/github.js:138:37
       'values.schema.json'
     ];
 
-    for (const path of configPaths) {
-      try {
-        if (path.endsWith('.yaml') || path.endsWith('.yml')) {
-          configs[path] = await this.getYamlContent(path, ref);
-        } else if (path.endsWith('.json')) {
-          const content = await this.getFileContent(path, ref);
-          configs[path] = JSON.parse(content);
-        }
-      } catch (error) {
-        // File might not exist in this version, skip it
-        console.debug(`Skipping ${path}: ${error.message}`);
-      }
-    }
+    for (const path of configPaths) {}
 
     return configs;

[Survived] BlockStatement
src/github.js:139:11
     ];
 
     for (const path of configPaths) {
-      try {
-        if (path.endsWith('.yaml') || path.endsWith('.yml')) {
-          configs[path] = await this.getYamlContent(path, ref);
-        } else if (path.endsWith('.json')) {
-          const content = await this.getFileContent(path, ref);
-          configs[path] = JSON.parse(content);
-        }
-      } catch (error) {
+      try {} catch (error) {
         // File might not exist in this version, skip it
         console.debug(`Skipping ${path}: ${error.message}`);

[Survived] ConditionalExpression
src/github.js:140:13
 
     for (const path of configPaths) {
       try {
-        if (path.endsWith('.yaml') || path.endsWith('.yml')) {
+        if (true) {
           configs[path] = await this.getYamlContent(path, ref);
         } else if (path.endsWith('.json')) {

[Survived] MethodExpression
src/github.js:140:13
 
     for (const path of configPaths) {
       try {
-        if (path.endsWith('.yaml') || path.endsWith('.yml')) {
+        if (path.startsWith('.yaml') || path.endsWith('.yml')) {
           configs[path] = await this.getYamlContent(path, ref);
         } else if (path.endsWith('.json')) {

[Survived] MethodExpression
src/github.js:142:20
       try {
         if (path.endsWith('.yaml') || path.endsWith('.yml')) {
           configs[path] = await this.getYamlContent(path, ref);
-        } else if (path.endsWith('.json')) {
+        } else if (path.startsWith('.json')) {
           const content = await this.getFileContent(path, ref);
           configs[path] = JSON.parse(content);

[Survived] ConditionalExpression
src/github.js:142:20
       try {
         if (path.endsWith('.yaml') || path.endsWith('.yml')) {
           configs[path] = await this.getYamlContent(path, ref);
-        } else if (path.endsWith('.json')) {
+        } else if (false) {
           const content = await this.getFileContent(path, ref);
           configs[path] = JSON.parse(content);

[Survived] BlockStatement
src/github.js:146:23
           const content = await this.getFileContent(path, ref);
           configs[path] = JSON.parse(content);
         }
-      } catch (error) {
-        // File might not exist in this version, skip it
-        console.debug(`Skipping ${path}: ${error.message}`);
-      }
+      } catch (error) {}
     }
 

[Killed] BlockStatement
src/github.js:156:21
   }
 
   // Cache helpers
-  getFromCache(key) {
-    const item = cache.get(key);
-    if (!item) return null;
-    
-    if (Date.now() - item.timestamp > CACHE_TTL) {
-      cache.delete(key);
-      return null;
-    }
-    
-    return item.data;
-  }
+  getFromCache(key) {}
 
   setCache(key, data) {
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should return cached data within TTL
statusReason: expected undefined to deeply equal { test: 'data' }

[Killed] BooleanLiteral
src/github.js:158:9
   // Cache helpers
   getFromCache(key) {
     const item = cache.get(key);
-    if (!item) return null;
+    if (item) return null;
     
     if (Date.now() - item.timestamp > CACHE_TTL) {
killedBy: Smart Query Feature Natural Language Queries should understand "etcd" query
statusReason: expected 'could not load chart/values.yaml from…' to contain 'etcd'

[Killed] ConditionalExpression
src/github.js:158:9
   // Cache helpers
   getFromCache(key) {
     const item = cache.get(key);
-    if (!item) return null;
+    if (false) return null;
     
     if (Date.now() - item.timestamp > CACHE_TTL) {
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should return null for non-existent cache key
statusReason: Cannot read properties of undefined (reading 'timestamp')

[Killed] EqualityOperator
src/github.js:160:9
     const item = cache.get(key);
     if (!item) return null;
     
-    if (Date.now() - item.timestamp > CACHE_TTL) {
+    if (Date.now() - item.timestamp <= CACHE_TTL) {
       cache.delete(key);
       return null;
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should return cached data within TTL
statusReason: expected null to deeply equal { test: 'data' }

[Killed] ArithmeticOperator
src/github.js:160:9
     const item = cache.get(key);
     if (!item) return null;
     
-    if (Date.now() - item.timestamp > CACHE_TTL) {
+    if (Date.now() + item.timestamp > CACHE_TTL) {
       cache.delete(key);
       return null;
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should return cached data within TTL
statusReason: expected null to deeply equal { test: 'data' }

[Killed] BlockStatement
src/github.js:168:23
     return item.data;
   }
 
-  setCache(key, data) {
-    cache.set(key, {
-      data,
-      timestamp: Date.now()
-    });
-  }
+  setCache(key, data) {}
 
   clearCache() {
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should return cached data within TTL
statusReason: expected null to deeply equal { test: 'data' }

[Killed] BlockStatement
src/github.js:175:16
     });
   }
 
-  clearCache() {
-    cache.clear();
-  }
+  clearCache() {}
 }
 
killedBy: github.js - Security Edge Cases and Quirks QUIRK: Cache Behavior should clear all cache on clearCache()
statusReason: expected 'data1' to be null
