[Killed] ConditionalExpression
src/schema-validator.js:25:9
   for (const { path, value } of userPaths) {
     const validation = validatePath(path, value, schema);
 
-    if (!validation.valid) {
+    if (true) {
       errors.push({
         path,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:31:31
         severity: 'error',
         error: validation.error,
         suggestion: validation.suggestion,
-        correct_alternatives: validation.alternatives || []
+        correct_alternatives: false
       });
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: actual value must be number or bigint, received "undefined"

[Killed] LogicalOperator
src/schema-validator.js:31:31
         severity: 'error',
         error: validation.error,
         suggestion: validation.suggestion,
-        correct_alternatives: validation.alternatives || []
+        correct_alternatives: validation.alternatives && []
       });
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:36:9
     }
 
     // If path is valid, check type and enum constraints
-    if (validation.valid && validation.schemaNode) {
+    if (false) {
       const typeCheck = validateType(value, validation.schemaNode, path);
       if (!typeCheck.valid) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:36:9
     }
 
     // If path is valid, check type and enum constraints
-    if (validation.valid && validation.schemaNode) {
+    if (true) {
       const typeCheck = validateType(value, validation.schemaNode, path);
       if (!typeCheck.valid) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/schema-validator.js:38:29
     // If path is valid, check type and enum constraints
     if (validation.valid && validation.schemaNode) {
       const typeCheck = validateType(value, validation.schemaNode, path);
-      if (!typeCheck.valid) {
-        errors.push({
-          path,
-          severity: 'error',
-          error: typeCheck.error,
-          expected_type: typeCheck.expectedType,
-          actual_type: typeCheck.actualType,
-          fix: typeCheck.fix
-        });
-      }
+      if (!typeCheck.valid) {}
 
       // Check enum constraints
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:38:11
     // If path is valid, check type and enum constraints
     if (validation.valid && validation.schemaNode) {
       const typeCheck = validateType(value, validation.schemaNode, path);
-      if (!typeCheck.valid) {
+      if (typeCheck.valid) {
         errors.push({
           path,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/schema-validator.js:41:21
       if (!typeCheck.valid) {
         errors.push({
           path,
-          severity: 'error',
+          severity: "",
           error: typeCheck.error,
           expected_type: typeCheck.expectedType,

[Killed] ConditionalExpression
src/schema-validator.js:50:11
       }
 
       // Check enum constraints
-      if (validation.schemaNode.enum) {
+      if (false) {
         const enumCheck = validateEnum(value, validation.schemaNode.enum, path);
         if (!enumCheck.valid) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:50:11
       }
 
       // Check enum constraints
-      if (validation.schemaNode.enum) {
+      if (true) {
         const enumCheck = validateEnum(value, validation.schemaNode.enum, path);
         if (!enumCheck.valid) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
src/schema-validator.js:52:31
       // Check enum constraints
       if (validation.schemaNode.enum) {
         const enumCheck = validateEnum(value, validation.schemaNode.enum, path);
-        if (!enumCheck.valid) {
-          errors.push({
-            path,
-            severity: 'error',
-            error: enumCheck.error,
-            allowed_values: validation.schemaNode.enum,
-            actual_value: value
-          });
-        }
+        if (!enumCheck.valid) {}
       }
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:52:13
       // Check enum constraints
       if (validation.schemaNode.enum) {
         const enumCheck = validateEnum(value, validation.schemaNode.enum, path);
-        if (!enumCheck.valid) {
+        if (true) {
           errors.push({
             path,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:53:23
       if (validation.schemaNode.enum) {
         const enumCheck = validateEnum(value, validation.schemaNode.enum, path);
         if (!enumCheck.valid) {
-          errors.push({
-            path,
-            severity: 'error',
-            error: enumCheck.error,
-            allowed_values: validation.schemaNode.enum,
-            actual_value: value
-          });
+          errors.push({});
         }
       }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/schema-validator.js:73:24
   const missing = checkRequiredFields(userConfig, schema);
   errors.push(...missing);
 
-  const schema_valid = errors.length === 0;
+  const schema_valid = false;
   const deploy_safe = errors.length === 0 && contextErrors.length === 0;
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:73:24
   const missing = checkRequiredFields(userConfig, schema);
   errors.push(...missing);
 
-  const schema_valid = errors.length === 0;
+  const schema_valid = true;
   const deploy_safe = errors.length === 0 && contextErrors.length === 0;
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:74:23
   errors.push(...missing);
 
   const schema_valid = errors.length === 0;
-  const deploy_safe = errors.length === 0 && contextErrors.length === 0;
+  const deploy_safe = true;
 
   return {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:74:23
   errors.push(...missing);
 
   const schema_valid = errors.length === 0;
-  const deploy_safe = errors.length === 0 && contextErrors.length === 0;
+  const deploy_safe = true && contextErrors.length === 0;
 
   return {
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate error summary with error count
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:76:10
   const schema_valid = errors.length === 0;
   const deploy_safe = errors.length === 0 && contextErrors.length === 0;
 
-  return {
-    syntax_valid: true,
-    schema_valid,
-    deploy_safe,
-    version,
-    errors,
-    warnings,
-    context_errors: contextErrors,
-    summary: generateSummary(errors, contextErrors, deploy_safe)
-  };
+  return {};
 }
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected undefined to be true // Object.is equality

[Survived] BooleanLiteral
src/schema-validator.js:77:19
   const deploy_safe = errors.length === 0 && contextErrors.length === 0;
 
   return {
-    syntax_valid: true,
+    syntax_valid: false,
     schema_valid,
     deploy_safe,

[Killed] BlockStatement
src/schema-validator.js:91:44
 /**
  * Extract all paths from user config with values
  */
-function extractAllPaths(obj, prefix = '') {
-  const paths = [];
-
-  if (obj && typeof obj === 'object' && !Array.isArray(obj)) {
-    for (const [key, value] of Object.entries(obj)) {
-      const path = prefix ? `${prefix}.${key}` : key;
-      paths.push({ path, value });
-
-      // Recurse for nested objects
-      if (value && typeof value === 'object' && !Array.isArray(value)) {
-        paths.push(...extractAllPaths(value, path));
-      }
-    }
-  }
-
-  return paths;
-}
+function extractAllPaths(obj, prefix = '') {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: userPaths is not iterable

[Killed] StringLiteral
src/schema-validator.js:91:40
 /**
  * Extract all paths from user config with values
  */
-function extractAllPaths(obj, prefix = '') {
+function extractAllPaths(obj, prefix = "Stryker was here!") {
   const paths = [];
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:94:14
 function extractAllPaths(obj, prefix = '') {
   const paths = [];
 
-  if (obj && typeof obj === 'object' && !Array.isArray(obj)) {
+  if (obj && typeof obj !== 'object' && !Array.isArray(obj)) {
     for (const [key, value] of Object.entries(obj)) {
       const path = prefix ? `${prefix}.${key}` : key;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:94:41
 function extractAllPaths(obj, prefix = '') {
   const paths = [];
 
-  if (obj && typeof obj === 'object' && !Array.isArray(obj)) {
+  if (obj && typeof obj === 'object' && Array.isArray(obj)) {
     for (const [key, value] of Object.entries(obj)) {
       const path = prefix ? `${prefix}.${key}` : key;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:95:53
   const paths = [];
 
   if (obj && typeof obj === 'object' && !Array.isArray(obj)) {
-    for (const [key, value] of Object.entries(obj)) {
-      const path = prefix ? `${prefix}.${key}` : key;
-      paths.push({ path, value });
-
-      // Recurse for nested objects
-      if (value && typeof value === 'object' && !Array.isArray(value)) {
-        paths.push(...extractAllPaths(value, path));
-      }
-    }
+    for (const [key, value] of Object.entries(obj)) {}
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected true to be false // Object.is equality

[Survived] EqualityOperator
src/schema-validator.js:100:20
       paths.push({ path, value });
 
       // Recurse for nested objects
-      if (value && typeof value === 'object' && !Array.isArray(value)) {
+      if (value && typeof value !== 'object' && !Array.isArray(value)) {
         paths.push(...extractAllPaths(value, path));
       }

[Survived] ConditionalExpression
src/schema-validator.js:100:20
       paths.push({ path, value });
 
       // Recurse for nested objects
-      if (value && typeof value === 'object' && !Array.isArray(value)) {
+      if (value && true && !Array.isArray(value)) {
         paths.push(...extractAllPaths(value, path));
       }

[Killed] StringLiteral
src/schema-validator.js:113:28
  * Validate if a path exists in schema
  */
 function validatePath(path, value, schema) {
-  const parts = path.split('.');
+  const parts = path.split("");
   let current = schema.properties || schema;
   let schemaNode = null;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:114:17
  */
 function validatePath(path, value, schema) {
   const parts = path.split('.');
-  let current = schema.properties || schema;
+  let current = false;
   let schemaNode = null;
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:114:17
  */
 function validatePath(path, value, schema) {
   const parts = path.split('.');
-  let current = schema.properties || schema;
+  let current = true;
   let schemaNode = null;
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
src/schema-validator.js:117:37
   let current = schema.properties || schema;
   let schemaNode = null;
 
-  for (let i = 0; i < parts.length; i++) {
+  for (let i = 0; i < parts.length; i--) {
     const part = parts[i];
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:117:19
   let current = schema.properties || schema;
   let schemaNode = null;
 
-  for (let i = 0; i < parts.length; i++) {
+  for (let i = 0; false; i++) {
     const part = parts[i];
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:120:9
   for (let i = 0; i < parts.length; i++) {
     const part = parts[i];
 
-    if (!current || !current[part]) {
+    if (current || !current[part]) {
       // Path doesn't exist in schema
       return {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:120:37
   for (let i = 0; i < parts.length; i++) {
     const part = parts[i];
 
-    if (!current || !current[part]) {
-      // Path doesn't exist in schema
-      return {
-        valid: false,
-        error: `Path does not exist in schema`,
-        suggestion: `Path '${path}' not found in schema`,
-        alternatives: findSimilarPaths(path, schema)
-      };
-    }
+    if (!current || !current[part]) {}
 
     schemaNode = current[part];
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'properties')

[Killed] BlockStatement
src/schema-validator.js:133:32
     schemaNode = current[part];
 
     // Navigate deeper
-    if (schemaNode.properties) {
-      current = schemaNode.properties;
-    } else if (schemaNode.additionalProperties) {
+    if (schemaNode.properties) {} else if (schemaNode.additionalProperties) {
       current = schemaNode.additionalProperties;
     } else if (i < parts.length - 1) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:133:9
     schemaNode = current[part];
 
     // Navigate deeper
-    if (schemaNode.properties) {
+    if (false) {
       current = schemaNode.properties;
     } else if (schemaNode.additionalProperties) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/schema-validator.js:135:16
     // Navigate deeper
     if (schemaNode.properties) {
       current = schemaNode.properties;
-    } else if (schemaNode.additionalProperties) {
+    } else if (true) {
       current = schemaNode.additionalProperties;
     } else if (i < parts.length - 1) {

[Survived] BlockStatement
src/schema-validator.js:135:49
     // Navigate deeper
     if (schemaNode.properties) {
       current = schemaNode.properties;
-    } else if (schemaNode.additionalProperties) {
-      current = schemaNode.additionalProperties;
-    } else if (i < parts.length - 1) {
+    } else if (schemaNode.additionalProperties) {} else if (i < parts.length - 1) {
       // Can't go deeper but we're not at the end
       if (typeof value === 'object' && value !== null) {

[Killed] EqualityOperator
src/schema-validator.js:137:16
       current = schemaNode.properties;
     } else if (schemaNode.additionalProperties) {
       current = schemaNode.additionalProperties;
-    } else if (i < parts.length - 1) {
+    } else if (i <= parts.length - 1) {
       // Can't go deeper but we're not at the end
       if (typeof value === 'object' && value !== null) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle empty objects correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:137:16
       current = schemaNode.properties;
     } else if (schemaNode.additionalProperties) {
       current = schemaNode.additionalProperties;
-    } else if (i < parts.length - 1) {
+    } else if (true) {
       // Can't go deeper but we're not at the end
       if (typeof value === 'object' && value !== null) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle empty objects correctly
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/schema-validator.js:139:11
       current = schemaNode.additionalProperties;
     } else if (i < parts.length - 1) {
       // Can't go deeper but we're not at the end
-      if (typeof value === 'object' && value !== null) {
+      if (typeof value === 'object' || value !== null) {
         return {
           valid: false,

[Survived] ConditionalExpression
src/schema-validator.js:139:11
       current = schemaNode.additionalProperties;
     } else if (i < parts.length - 1) {
       // Can't go deeper but we're not at the end
-      if (typeof value === 'object' && value !== null) {
+      if (false) {
         return {
           valid: false,

[Survived] MethodExpression
src/schema-validator.js:142:27
       if (typeof value === 'object' && value !== null) {
         return {
           valid: false,
-          error: `Path '${parts.slice(0, i + 1).join('.')}' is a leaf node`,
+          error: `Path '${parts.join('.')}' is a leaf node`,
           suggestion: `Remove nested properties under '${parts.slice(0, i + 1).join('.')}'`
         };

[Survived] ArithmeticOperator
src/schema-validator.js:142:42
       if (typeof value === 'object' && value !== null) {
         return {
           valid: false,
-          error: `Path '${parts.slice(0, i + 1).join('.')}' is a leaf node`,
+          error: `Path '${parts.slice(0, i - 1).join('.')}' is a leaf node`,
           suggestion: `Remove nested properties under '${parts.slice(0, i + 1).join('.')}'`
         };

[Survived] MethodExpression
src/schema-validator.js:143:58
         return {
           valid: false,
           error: `Path '${parts.slice(0, i + 1).join('.')}' is a leaf node`,
-          suggestion: `Remove nested properties under '${parts.slice(0, i + 1).join('.')}'`
+          suggestion: `Remove nested properties under '${parts.join('.')}'`
         };
       }

[Survived] ArithmeticOperator
src/schema-validator.js:143:73
         return {
           valid: false,
           error: `Path '${parts.slice(0, i + 1).join('.')}' is a leaf node`,
-          suggestion: `Remove nested properties under '${parts.slice(0, i + 1).join('.')}'`
+          suggestion: `Remove nested properties under '${parts.slice(0, i - 1).join('.')}'`
         };
       }

[Killed] ObjectLiteral
src/schema-validator.js:149:10
     }
   }
 
-  return {
-    valid: true,
-    schemaNode
-  };
+  return {};
 }
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:150:12
   }
 
   return {
-    valid: true,
+    valid: false,
     schemaNode
   };
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:163:7
  */
 function findSimilarPaths(targetPath, schema, maxSuggestions = 3) {
   const allPaths = extractSchemaPaths(schema);
-  if (allPaths.length === 0) return [];
+  if (true) return [];
 
   const targetParts = targetPath.toLowerCase().split('.');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/schema-validator.js:163:7
  */
 function findSimilarPaths(targetPath, schema, maxSuggestions = 3) {
   const allPaths = extractSchemaPaths(schema);
-  if (allPaths.length === 0) return [];
+  if (allPaths.length !== 0) return [];
 
   const targetParts = targetPath.toLowerCase().split('.');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/schema-validator.js:165:23
   const allPaths = extractSchemaPaths(schema);
   if (allPaths.length === 0) return [];
 
-  const targetParts = targetPath.toLowerCase().split('.');
+  const targetParts = targetPath.toUpperCase().split('.');
   const targetLast = targetParts[targetParts.length - 1];
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Survived] StringLiteral
src/schema-validator.js:165:54
   const allPaths = extractSchemaPaths(schema);
   if (allPaths.length === 0) return [];
 
-  const targetParts = targetPath.toLowerCase().split('.');
+  const targetParts = targetPath.toLowerCase().split("");
   const targetLast = targetParts[targetParts.length - 1];
 

[Killed] ArithmeticOperator
src/schema-validator.js:166:34
   if (allPaths.length === 0) return [];
 
   const targetParts = targetPath.toLowerCase().split('.');
-  const targetLast = targetParts[targetParts.length - 1];
+  const targetLast = targetParts[targetParts.length + 1];
 
   // Categorize matches by clear priorities (no arbitrary scoring)
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] ArrayDeclaration
src/schema-validator.js:170:28
 
   // Categorize matches by clear priorities (no arbitrary scoring)
   const exactMatches = [];
-  const substringMatches = [];
+  const substringMatches = ["Stryker was here"];
   const prefixMatches = [];
 

[Survived] ArrayDeclaration
src/schema-validator.js:171:25
   // Categorize matches by clear priorities (no arbitrary scoring)
   const exactMatches = [];
   const substringMatches = [];
-  const prefixMatches = [];
+  const prefixMatches = ["Stryker was here"];
 
   for (const schemaPath of allPaths) {

[Killed] BlockStatement
src/schema-validator.js:173:38
   const substringMatches = [];
   const prefixMatches = [];
 
-  for (const schemaPath of allPaths) {
-    const parts = schemaPath.toLowerCase().split('.');
-    const last = parts[parts.length - 1];
-
-    // Priority 1: Exact last segment match
-    if (last === targetLast) {
-      exactMatches.push(schemaPath);
-      continue;
-    }
-
-    // Priority 2: Substring match in last segment
-    if (last.includes(targetLast) || targetLast.includes(last)) {
-      substringMatches.push(schemaPath);
-      continue;
-    }
-
-    // Priority 3: Shared path prefix
-    const sharedPrefixLength = getSharedPrefix(targetParts, parts);
-    if (sharedPrefixLength > 0) {
-      prefixMatches.push({ path: schemaPath, prefixLength: sharedPrefixLength });
-    }
-  }
+  for (const schemaPath of allPaths) {}
 
   // Sort prefix matches by shared prefix length (longer is better)
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/schema-validator.js:174:19
   const prefixMatches = [];
 
   for (const schemaPath of allPaths) {
-    const parts = schemaPath.toLowerCase().split('.');
+    const parts = schemaPath.toUpperCase().split('.');
     const last = parts[parts.length - 1];
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Survived] StringLiteral
src/schema-validator.js:174:50
   const prefixMatches = [];
 
   for (const schemaPath of allPaths) {
-    const parts = schemaPath.toLowerCase().split('.');
+    const parts = schemaPath.toLowerCase().split("");
     const last = parts[parts.length - 1];
 

[Killed] ArithmeticOperator
src/schema-validator.js:175:24
 
   for (const schemaPath of allPaths) {
     const parts = schemaPath.toLowerCase().split('.');
-    const last = parts[parts.length - 1];
+    const last = parts[parts.length + 1];
 
     // Priority 1: Exact last segment match
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] ConditionalExpression
src/schema-validator.js:178:9
     const last = parts[parts.length - 1];
 
     // Priority 1: Exact last segment match
-    if (last === targetLast) {
+    if (true) {
       exactMatches.push(schemaPath);
       continue;

[Survived] BlockStatement
src/schema-validator.js:178:30
     const last = parts[parts.length - 1];
 
     // Priority 1: Exact last segment match
-    if (last === targetLast) {
-      exactMatches.push(schemaPath);
-      continue;
-    }
+    if (last === targetLast) {}
 
     // Priority 2: Substring match in last segment

[Killed] ConditionalExpression
src/schema-validator.js:184:9
     }
 
     // Priority 2: Substring match in last segment
-    if (last.includes(targetLast) || targetLast.includes(last)) {
+    if (false) {
       substringMatches.push(schemaPath);
       continue;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0
