[Killed] LogicalOperator
src/schema-validator.js:184:9
     }
 
     // Priority 2: Substring match in last segment
-    if (last.includes(targetLast) || targetLast.includes(last)) {
+    if (last.includes(targetLast) && targetLast.includes(last)) {
       substringMatches.push(schemaPath);
       continue;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/schema-validator.js:191:9
 
     // Priority 3: Shared path prefix
     const sharedPrefixLength = getSharedPrefix(targetParts, parts);
-    if (sharedPrefixLength > 0) {
+    if (true) {
       prefixMatches.push({ path: schemaPath, prefixLength: sharedPrefixLength });
     }

[Survived] ConditionalExpression
src/schema-validator.js:191:9
 
     // Priority 3: Shared path prefix
     const sharedPrefixLength = getSharedPrefix(targetParts, parts);
-    if (sharedPrefixLength > 0) {
+    if (false) {
       prefixMatches.push({ path: schemaPath, prefixLength: sharedPrefixLength });
     }

[Survived] ArrowFunction
src/schema-validator.js:197:22
   }
 
   // Sort prefix matches by shared prefix length (longer is better)
-  prefixMatches.sort((a, b) => b.prefixLength - a.prefixLength);
+  prefixMatches.sort(() => undefined);
 
   // Combine in strict priority order

[NoCoverage] ArithmeticOperator
src/schema-validator.js:197:32
   }
 
   // Sort prefix matches by shared prefix length (longer is better)
-  prefixMatches.sort((a, b) => b.prefixLength - a.prefixLength);
+  prefixMatches.sort((a, b) => b.prefixLength + a.prefixLength);
 
   // Combine in strict priority order

[Killed] ArrayDeclaration
src/schema-validator.js:200:23
   prefixMatches.sort((a, b) => b.prefixLength - a.prefixLength);
 
   // Combine in strict priority order
-  const suggestions = [
-    ...exactMatches,
-    ...substringMatches,
-    ...prefixMatches.map(m => m.path)
-  ];
+  const suggestions = [];
 
   return suggestions.slice(0, maxSuggestions);
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Survived] ArrowFunction
src/schema-validator.js:203:26
   const suggestions = [
     ...exactMatches,
     ...substringMatches,
-    ...prefixMatches.map(m => m.path)
+    ...prefixMatches.map(() => undefined)
   ];
 

[Survived] MethodExpression
src/schema-validator.js:206:10
     ...prefixMatches.map(m => m.path)
   ];
 
-  return suggestions.slice(0, maxSuggestions);
+  return suggestions;
 }
 

[Killed] BlockStatement
src/schema-validator.js:213:50
  * Extract all paths from schema
  * Contract: schema must be an object with optional .properties field
  */
-function extractSchemaPaths(schema, prefix = '') {
-  if (!schema || typeof schema !== 'object') {
-    return [];
-  }
-
-  const paths = [];
-  // Explicit contract: use .properties if present, otherwise treat schema as properties object
-  const props = schema.properties || schema;
-
-  for (const [key, value] of Object.entries(props)) {
-    const path = prefix ? `${prefix}.${key}` : key;
-    paths.push(path);
-
-    // Recurse if nested properties exist
-    if (value && typeof value === 'object' && value.properties) {
-      paths.push(...extractSchemaPaths(value, path));
-    }
-  }
-
-  return paths;
-}
+function extractSchemaPaths(schema, prefix = '') {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/schema-validator.js:214:18
  * Contract: schema must be an object with optional .properties field
  */
 function extractSchemaPaths(schema, prefix = '') {
-  if (!schema || typeof schema !== 'object') {
+  if (!schema || typeof schema === 'object') {
     return [];
   }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:214:7
  * Contract: schema must be an object with optional .properties field
  */
 function extractSchemaPaths(schema, prefix = '') {
-  if (!schema || typeof schema !== 'object') {
+  if (true) {
     return [];
   }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/schema-validator.js:220:17
 
   const paths = [];
   // Explicit contract: use .properties if present, otherwise treat schema as properties object
-  const props = schema.properties || schema;
+  const props = schema.properties && schema;
 
   for (const [key, value] of Object.entries(props)) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:220:17
 
   const paths = [];
   // Explicit contract: use .properties if present, otherwise treat schema as properties object
-  const props = schema.properties || schema;
+  const props = false;
 
   for (const [key, value] of Object.entries(props)) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/schema-validator.js:222:53
   // Explicit contract: use .properties if present, otherwise treat schema as properties object
   const props = schema.properties || schema;
 
-  for (const [key, value] of Object.entries(props)) {
-    const path = prefix ? `${prefix}.${key}` : key;
-    paths.push(path);
-
-    // Recurse if nested properties exist
-    if (value && typeof value === 'object' && value.properties) {
-      paths.push(...extractSchemaPaths(value, path));
-    }
-  }
+  for (const [key, value] of Object.entries(props)) {}
 
   return paths;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: expected 0 to be greater than 0

[Survived] StringLiteral
src/schema-validator.js:223:27
   const props = schema.properties || schema;
 
   for (const [key, value] of Object.entries(props)) {
-    const path = prefix ? `${prefix}.${key}` : key;
+    const path = prefix ? `` : key;
     paths.push(path);
 

[Survived] ConditionalExpression
src/schema-validator.js:227:9
     paths.push(path);
 
     // Recurse if nested properties exist
-    if (value && typeof value === 'object' && value.properties) {
+    if (true) {
       paths.push(...extractSchemaPaths(value, path));
     }

[Survived] ConditionalExpression
src/schema-validator.js:227:9
     paths.push(path);
 
     // Recurse if nested properties exist
-    if (value && typeof value === 'object' && value.properties) {
+    if (true && value.properties) {
       paths.push(...extractSchemaPaths(value, path));
     }

[Survived] BlockStatement
src/schema-validator.js:238:38
 /**
  * Get shared prefix length
  */
-function getSharedPrefix(arr1, arr2) {
-  let count = 0;
-  const minLen = Math.min(arr1.length, arr2.length);
-
-  for (let i = 0; i < minLen; i++) {
-    if (arr1[i] === arr2[i]) count++;
-    else break;
-  }
-
-  return count;
-}
+function getSharedPrefix(arr1, arr2) {}
 
 /**

[Survived] MethodExpression
src/schema-validator.js:240:18
  */
 function getSharedPrefix(arr1, arr2) {
   let count = 0;
-  const minLen = Math.min(arr1.length, arr2.length);
+  const minLen = Math.max(arr1.length, arr2.length);
 
   for (let i = 0; i < minLen; i++) {

[Survived] EqualityOperator
src/schema-validator.js:242:19
   let count = 0;
   const minLen = Math.min(arr1.length, arr2.length);
 
-  for (let i = 0; i < minLen; i++) {
+  for (let i = 0; i <= minLen; i++) {
     if (arr1[i] === arr2[i]) count++;
     else break;

[Survived] EqualityOperator
src/schema-validator.js:242:19
   let count = 0;
   const minLen = Math.min(arr1.length, arr2.length);
 
-  for (let i = 0; i < minLen; i++) {
+  for (let i = 0; i >= minLen; i++) {
     if (arr1[i] === arr2[i]) count++;
     else break;

[Survived] ConditionalExpression
src/schema-validator.js:243:9
   const minLen = Math.min(arr1.length, arr2.length);
 
   for (let i = 0; i < minLen; i++) {
-    if (arr1[i] === arr2[i]) count++;
+    if (false) count++;
     else break;
   }

[Survived] UpdateOperator
src/schema-validator.js:243:30
   const minLen = Math.min(arr1.length, arr2.length);
 
   for (let i = 0; i < minLen; i++) {
-    if (arr1[i] === arr2[i]) count++;
+    if (arr1[i] === arr2[i]) count--;
     else break;
   }

[Killed] ConditionalExpression
src/schema-validator.js:257:7
   const expectedType = schemaNode.type;
   const actualType = getValueType(value);
 
-  if (!expectedType) {
+  if (true) {
     return { valid: true };
   }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:257:7
   const expectedType = schemaNode.type;
   const actualType = getValueType(value);
 
-  if (!expectedType) {
+  if (false) {
     return { valid: true };
   }
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Schema Structure Variations should handle schema with missing type definitions
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:258:21
   const actualType = getValueType(value);
 
   if (!expectedType) {
-    return { valid: true };
+    return { valid: false };
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Schema Structure Variations should handle schema with missing type definitions
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:258:12
   const actualType = getValueType(value);
 
   if (!expectedType) {
-    return { valid: true };
+    return {};
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Schema Structure Variations should handle schema with missing type definitions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:263:7
 
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
 
-  if (!expectedTypes.includes(actualType)) {
+  if (false) {
     if (value === null && expectedTypes.includes('null')) {
       return { valid: true };
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:263:7
 
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
 
-  if (!expectedTypes.includes(actualType)) {
+  if (true) {
     if (value === null && expectedTypes.includes('null')) {
       return { valid: true };
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/schema-validator.js:264:9
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
 
   if (!expectedTypes.includes(actualType)) {
-    if (value === null && expectedTypes.includes('null')) {
+    if (value === null || expectedTypes.includes('null')) {
       return { valid: true };
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Type Validation Edge Cases should distinguish between null and undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:264:9
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
 
   if (!expectedTypes.includes(actualType)) {
-    if (value === null && expectedTypes.includes('null')) {
+    if (true) {
       return { valid: true };
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/schema-validator.js:265:23
 
   if (!expectedTypes.includes(actualType)) {
     if (value === null && expectedTypes.includes('null')) {
-      return { valid: true };
+      return { valid: false };
     }
 

[Killed] StringLiteral
src/schema-validator.js:270:14
 
     return {
       valid: false,
-      error: `Type mismatch`,
+      error: ``,
       expectedType: expectedTypes.join(' or '),
       actualType,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected '' to contain 'Type mismatch'

[Killed] StringLiteral
src/schema-validator.js:273:12
       error: `Type mismatch`,
       expectedType: expectedTypes.join(' or '),
       actualType,
-      fix: `Change value to type: ${expectedTypes.join(' or ')}`
+      fix: ``
     };
   }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected '' to contain 'Change value to type'

[Survived] StringLiteral
src/schema-validator.js:273:56
       error: `Type mismatch`,
       expectedType: expectedTypes.join(' or '),
       actualType,
-      fix: `Change value to type: ${expectedTypes.join(' or ')}`
+      fix: `Change value to type: ${expectedTypes.join("")}`
     };
   }

[Killed] BlockStatement
src/schema-validator.js:283:30
 /**
  * Get JavaScript type
  */
-function getValueType(value) {
-  if (value === null) return 'null';
-  if (Array.isArray(value)) return 'array';
-  if (typeof value === 'boolean') return 'boolean';
-  if (typeof value === 'number') return 'number';
-  if (typeof value === 'string') return 'string';
-  if (typeof value === 'object') return 'object';
-  return 'unknown';
-}
+function getValueType(value) {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:284:7
  * Get JavaScript type
  */
 function getValueType(value) {
-  if (value === null) return 'null';
+  if (true) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:284:7
  * Get JavaScript type
  */
 function getValueType(value) {
-  if (value === null) return 'null';
+  if (false) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Type Validation Edge Cases should distinguish between null and undefined
statusReason: expected 'object' to be 'null' // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:285:7
  */
 function getValueType(value) {
   if (value === null) return 'null';
-  if (Array.isArray(value)) return 'array';
+  if (true) return 'array';
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:285:7
  */
 function getValueType(value) {
   if (value === null) return 'null';
-  if (Array.isArray(value)) return 'array';
+  if (false) return 'array';
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures QUIRK: should ignore arrays in path extraction (objects only)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:286:7
 function getValueType(value) {
   if (value === null) return 'null';
   if (Array.isArray(value)) return 'array';
-  if (typeof value === 'boolean') return 'boolean';
+  if (true) return 'boolean';
   if (typeof value === 'number') return 'number';
   if (typeof value === 'string') return 'string';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:286:7
 function getValueType(value) {
   if (value === null) return 'null';
   if (Array.isArray(value)) return 'array';
-  if (typeof value === 'boolean') return 'boolean';
+  if (false) return 'boolean';
   if (typeof value === 'number') return 'number';
   if (typeof value === 'string') return 'string';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Type Validation Edge Cases should handle union types correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:287:7
   if (value === null) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
-  if (typeof value === 'number') return 'number';
+  if (false) return 'number';
   if (typeof value === 'string') return 'string';
   if (typeof value === 'object') return 'object';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Type Validation Edge Cases should handle union types correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:287:7
   if (value === null) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
-  if (typeof value === 'number') return 'number';
+  if (true) return 'number';
   if (typeof value === 'string') return 'string';
   if (typeof value === 'object') return 'object';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:288:7
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
-  if (typeof value === 'string') return 'string';
+  if (false) return 'string';
   if (typeof value === 'object') return 'object';
   return 'unknown';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:288:7
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
-  if (typeof value === 'string') return 'string';
+  if (typeof value !== 'string') return 'string';
   if (typeof value === 'object') return 'object';
   return 'unknown';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:289:7
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
   if (typeof value === 'string') return 'string';
-  if (typeof value === 'object') return 'object';
+  if (false) return 'object';
   return 'unknown';
 }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:289:7
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
   if (typeof value === 'string') return 'string';
-  if (typeof value === 'object') return 'object';
+  if (typeof value !== 'object') return 'object';
   return 'unknown';
 }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:296:51
 /**
  * Validate enum constraints
  */
-function validateEnum(value, allowedValues, path) {
-  if (!allowedValues.includes(value)) {
-    return {
-      valid: false,
-      error: `Value '${value}' not in allowed values: ${allowedValues.join(', ')}`
-    };
-  }
-
-  return { valid: true };
-}
+function validateEnum(value, allowedValues, path) {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] ConditionalExpression
src/schema-validator.js:297:7
  * Validate enum constraints
  */
 function validateEnum(value, allowedValues, path) {
-  if (!allowedValues.includes(value)) {
+  if (false) {
     return {
       valid: false,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:297:7
  * Validate enum constraints
  */
 function validateEnum(value, allowedValues, path) {
-  if (!allowedValues.includes(value)) {
+  if (true) {
     return {
       valid: false,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:298:12
  */
 function validateEnum(value, allowedValues, path) {
   if (!allowedValues.includes(value)) {
-    return {
-      valid: false,
-      error: `Value '${value}' not in allowed values: ${allowedValues.join(', ')}`
-    };
+    return {};
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
src/schema-validator.js:311:21
  * Detect conflicting configurations
  */
 function detectConflicts(userConfig) {
-  const conflicts = [];
+  const conflicts = ["Stryker was here"];
 
   // Check multiple distros enabled
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected undefined to be 'Multiple distros enabled' // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:314:7
   const conflicts = [];
 
   // Check multiple distros enabled
-  if (userConfig.controlPlane?.distro) {
+  if (false) {
     const distros = userConfig.controlPlane.distro;
     const enabled = [];
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:314:7
   const conflicts = [];
 
   // Check multiple distros enabled
-  if (userConfig.controlPlane?.distro) {
+  if (true) {
     const distros = userConfig.controlPlane.distro;
     const enabled = [];
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: Cannot read properties of undefined (reading 'distro')

[Killed] ConditionalExpression
src/schema-validator.js:318:9
     const distros = userConfig.controlPlane.distro;
     const enabled = [];
 
-    if (distros.k3s?.enabled === true) enabled.push('k3s');
+    if (false) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/schema-validator.js:318:34
     const distros = userConfig.controlPlane.distro;
     const enabled = [];
 
-    if (distros.k3s?.enabled === true) enabled.push('k3s');
+    if (distros.k3s?.enabled === false) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/schema-validator.js:319:9
     const enabled = [];
 
     if (distros.k3s?.enabled === true) enabled.push('k3s');
-    if (distros.k8s?.enabled === true) enabled.push('k8s');
+    if (distros.k8s?.enabled !== true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:319:9
     const enabled = [];
 
     if (distros.k3s?.enabled === true) enabled.push('k3s');
-    if (distros.k8s?.enabled === true) enabled.push('k8s');
+    if (true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should allow only one distro enabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:320:34
 
     if (distros.k3s?.enabled === true) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
-    if (distros.k0s?.enabled === true) enabled.push('k0s');
+    if (distros.k0s?.enabled === false) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should allow only one distro enabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:320:9
 
     if (distros.k3s?.enabled === true) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
-    if (distros.k0s?.enabled === true) enabled.push('k0s');
+    if (distros.k0s?.enabled !== true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should allow only one distro enabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] OptionalChaining
src/schema-validator.js:321:9
     if (distros.k3s?.enabled === true) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
-    if (distros.eks?.enabled === true) enabled.push('eks');
+    if (distros.eks.enabled === true) enabled.push('eks');
 
     if (enabled.length > 1) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] EqualityOperator
src/schema-validator.js:321:9
     if (distros.k3s?.enabled === true) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
-    if (distros.eks?.enabled === true) enabled.push('eks');
+    if (distros.eks?.enabled !== true) enabled.push('eks');
 
     if (enabled.length > 1) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should allow only one distro enabled
statusReason: expected 1 to be +0 // Object.is equality
