[Survived] StringLiteral
src/github.js:4:25
 import fetch from 'node-fetch';
 import yaml from 'js-yaml';
 
-const GITHUB_API_BASE = 'https://api.github.com';
+const GITHUB_API_BASE = "";
 const GITHUB_RAW_BASE = 'https://raw.githubusercontent.com';
 const REPO_OWNER = 'loft-sh';

[Survived] ArithmeticOperator
src/github.js:11:19
 
 // Cache for fetched content (15 minute TTL)
 const cache = new Map();
-const CACHE_TTL = 15 * 60 * 1000; // 15 minutes
+const CACHE_TTL = 15 / 60 * 1000; // 15 minutes
 
 class GitHubClient {

[Survived] ArithmeticOperator
src/github.js:11:19
 
 // Cache for fetched content (15 minute TTL)
 const cache = new Map();
-const CACHE_TTL = 15 * 60 * 1000; // 15 minutes
+const CACHE_TTL = 15 * 60 / 1000; // 15 minutes
 
 class GitHubClient {

[Survived] BlockStatement
src/github.js:14:17
 const CACHE_TTL = 15 * 60 * 1000; // 15 minutes
 
 class GitHubClient {
-  constructor() {
-    this.defaultBranch = 'main';
-  }
+  constructor() {}
 
   // Get list of available tags (versions)
