[Killed] EqualityOperator
src/schema-validator.js:323:9
     if (distros.k0s?.enabled === true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
 
-    if (enabled.length > 1) {
+    if (enabled.length >= 1) {
       conflicts.push({
         issue: 'Multiple distros enabled',
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should allow only one distro enabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:323:9
     if (distros.k0s?.enabled === true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
 
-    if (enabled.length > 1) {
+    if (false) {
       conflicts.push({
         issue: 'Multiple distros enabled',
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/schema-validator.js:326:19
     if (enabled.length > 1) {
       conflicts.push({
         issue: 'Multiple distros enabled',
-        severity: 'error',
+        severity: "",
         conflicting_paths: enabled.map(d => `controlPlane.distro.${d}.enabled: true`),
         error: 'Only one distro can be enabled at a time',
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected '' to be 'error' // Object.is equality

[Survived] ArrowFunction
src/schema-validator.js:327:40
       conflicts.push({
         issue: 'Multiple distros enabled',
         severity: 'error',
-        conflicting_paths: enabled.map(d => `controlPlane.distro.${d}.enabled: true`),
+        conflicting_paths: enabled.map(() => undefined),
         error: 'Only one distro can be enabled at a time',
         fix: `Set only one distro to enabled: true. Currently: ${enabled.join(', ')}`

[Killed] BlockStatement
src/schema-validator.js:340:50
 /**
  * Check required fields
  */
-function checkRequiredFields(userConfig, schema) {
-  const errors = [];
-  const required = schema.required || [];
-
-  for (const field of required) {
-    if (!(field in userConfig)) {
-      errors.push({
-        path: field,
-        severity: 'error',
-        error: `Required field '${field}' is missing`,
-        fix: `Add '${field}' to configuration`
-      });
-    }
-  }
-
-  return errors;
-}
+function checkRequiredFields(userConfig, schema) {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: missing is not iterable (cannot read property undefined)

[Killed] LogicalOperator
src/schema-validator.js:342:20
  */
 function checkRequiredFields(userConfig, schema) {
   const errors = [];
-  const required = schema.required || [];
+  const required = schema.required && [];
 
   for (const field of required) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: required is not iterable

[Killed] ConditionalExpression
src/schema-validator.js:342:20
  */
 function checkRequiredFields(userConfig, schema) {
   const errors = [];
-  const required = schema.required || [];
+  const required = false;
 
   for (const field of required) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: required is not iterable

[Killed] BlockStatement
src/schema-validator.js:344:33
   const errors = [];
   const required = schema.required || [];
 
-  for (const field of required) {
-    if (!(field in userConfig)) {
-      errors.push({
-        path: field,
-        severity: 'error',
-        error: `Required field '${field}' is missing`,
-        fix: `Add '${field}' to configuration`
-      });
-    }
-  }
+  for (const field of required) {}
 
   return errors;
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:345:33
   const required = schema.required || [];
 
   for (const field of required) {
-    if (!(field in userConfig)) {
-      errors.push({
-        path: field,
-        severity: 'error',
-        error: `Required field '${field}' is missing`,
-        fix: `Add '${field}' to configuration`
-      });
-    }
+    if (!(field in userConfig)) {}
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:345:9
   const required = schema.required || [];
 
   for (const field of required) {
-    if (!(field in userConfig)) {
+    if (false) {
       errors.push({
         path: field,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/schema-validator.js:348:19
     if (!(field in userConfig)) {
       errors.push({
         path: field,
-        severity: 'error',
+        severity: "",
         error: `Required field '${field}' is missing`,
         fix: `Add '${field}' to configuration`
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected '' to be 'error' // Object.is equality

[Killed] StringLiteral
src/schema-validator.js:350:14
         path: field,
         severity: 'error',
         error: `Required field '${field}' is missing`,
-        fix: `Add '${field}' to configuration`
+        fix: ``
       });
     }
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected '' to contain 'Add'

[Killed] BlockStatement
src/schema-validator.js:361:61
 /**
  * Generate summary
  */
-function generateSummary(errors, contextErrors, deploySafe) {
-  const errorCount = errors.length;
-  const contextErrorCount = contextErrors.length;
-  const totalIssues = errorCount + contextErrorCount;
-
-  if (deploySafe) {
-    return {
-      deploy_safe: true,
-      message: 'Configuration is valid and safe to deploy',
-      total_errors: 0
-    };
-  }
-
-  return {
-    deploy_safe: false,
-    message: `Configuration contains ${totalIssues} error(s) and will fail deployment. Fix required before creating vCluster.`,
-    total_errors: totalIssues,
-    severity: 'error'
-  };
-}
+function generateSummary(errors, contextErrors, deploySafe) {}
 
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate deploy_safe summary when no errors
statusReason: Cannot read properties of undefined (reading 'deploy_safe')

[Survived] ArithmeticOperator
src/schema-validator.js:364:23
 function generateSummary(errors, contextErrors, deploySafe) {
   const errorCount = errors.length;
   const contextErrorCount = contextErrors.length;
-  const totalIssues = errorCount + contextErrorCount;
+  const totalIssues = errorCount - contextErrorCount;
 
   if (deploySafe) {

[Killed] BlockStatement
src/schema-validator.js:366:19
   const contextErrorCount = contextErrors.length;
   const totalIssues = errorCount + contextErrorCount;
 
-  if (deploySafe) {
-    return {
-      deploy_safe: true,
-      message: 'Configuration is valid and safe to deploy',
-      total_errors: 0
-    };
-  }
+  if (deploySafe) {}
 
   return {
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate deploy_safe summary when no errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:366:7
   const contextErrorCount = contextErrors.length;
   const totalIssues = errorCount + contextErrorCount;
 
-  if (deploySafe) {
+  if (true) {
     return {
       deploy_safe: true,
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate error summary with error count
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:368:20
 
   if (deploySafe) {
     return {
-      deploy_safe: true,
+      deploy_safe: false,
       message: 'Configuration is valid and safe to deploy',
       total_errors: 0
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate deploy_safe summary when no errors
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:374:10
     };
   }
 
-  return {
-    deploy_safe: false,
-    message: `Configuration contains ${totalIssues} error(s) and will fail deployment. Fix required before creating vCluster.`,
-    total_errors: totalIssues,
-    severity: 'error'
-  };
+  return {};
 }
 
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate error summary with error count
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/schema-validator.js:375:18
   }
 
   return {
-    deploy_safe: false,
+    deploy_safe: true,
     message: `Configuration contains ${totalIssues} error(s) and will fail deployment. Fix required before creating vCluster.`,
     total_errors: totalIssues,
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate error summary with error count
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/schema-validator.js:376:14
 
   return {
     deploy_safe: false,
-    message: `Configuration contains ${totalIssues} error(s) and will fail deployment. Fix required before creating vCluster.`,
+    message: ``,
     total_errors: totalIssues,
     severity: 'error'
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate error summary with error count
statusReason: expected '' to contain 'error'
