[Survived] MethodExpression
src/schema-validator.js:160:23
  */
 function findSimilarPaths(targetPath, schema, maxSuggestions = 3) {
   const allPaths = extractSchemaPaths(schema);
-  const targetParts = targetPath.toLowerCase().split('.');
+  const targetParts = targetPath.toUpperCase().split('.');
   const targetLast = targetParts[targetParts.length - 1];
 

[Killed] BlockStatement
src/schema-validator.js:163:45
   const targetParts = targetPath.toLowerCase().split('.');
   const targetLast = targetParts[targetParts.length - 1];
 
-  const scored = allPaths.map(schemaPath => {
-    const parts = schemaPath.toLowerCase().split('.');
-    const last = parts[parts.length - 1];
-
-    let score = 0;
-    if (last === targetLast) score += 10;
-    if (last.includes(targetLast) || targetLast.includes(last)) score += 5;
-
-    // Shared prefix
-    const sharedPrefix = getSharedPrefix(targetParts, parts);
-    score += sharedPrefix * 2;
-
-    return { path: schemaPath, score };
-  });
+  const scored = allPaths.map(schemaPath => {});
 
   return scored
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'score')

[Survived] MethodExpression
src/schema-validator.js:164:19
   const targetLast = targetParts[targetParts.length - 1];
 
   const scored = allPaths.map(schemaPath => {
-    const parts = schemaPath.toLowerCase().split('.');
+    const parts = schemaPath.toUpperCase().split('.');
     const last = parts[parts.length - 1];
 

[NoCoverage] AssignmentOperator
src/schema-validator.js:168:30
     const last = parts[parts.length - 1];
 
     let score = 0;
-    if (last === targetLast) score += 10;
+    if (last === targetLast) score -= 10;
     if (last.includes(targetLast) || targetLast.includes(last)) score += 5;
 

[Survived] EqualityOperator
src/schema-validator.js:168:9
     const last = parts[parts.length - 1];
 
     let score = 0;
-    if (last === targetLast) score += 10;
+    if (last !== targetLast) score += 10;
     if (last.includes(targetLast) || targetLast.includes(last)) score += 5;
 

[Survived] ConditionalExpression
src/schema-validator.js:169:9
 
     let score = 0;
     if (last === targetLast) score += 10;
-    if (last.includes(targetLast) || targetLast.includes(last)) score += 5;
+    if (false) score += 5;
 
     // Shared prefix

[Survived] LogicalOperator
src/schema-validator.js:169:9
 
     let score = 0;
     if (last === targetLast) score += 10;
-    if (last.includes(targetLast) || targetLast.includes(last)) score += 5;
+    if (last.includes(targetLast) && targetLast.includes(last)) score += 5;
 
     // Shared prefix

[Survived] AssignmentOperator
src/schema-validator.js:173:5
 
     // Shared prefix
     const sharedPrefix = getSharedPrefix(targetParts, parts);
-    score += sharedPrefix * 2;
+    score -= sharedPrefix * 2;
 
     return { path: schemaPath, score };

[Survived] ArithmeticOperator
src/schema-validator.js:173:14
 
     // Shared prefix
     const sharedPrefix = getSharedPrefix(targetParts, parts);
-    score += sharedPrefix * 2;
+    score += sharedPrefix / 2;
 
     return { path: schemaPath, score };

[Survived] MethodExpression
src/schema-validator.js:178:10
     return { path: schemaPath, score };
   });
 
-  return scored
-    .filter(s => s.score > 0)
-    .sort((a, b) => b.score - a.score)
-    .slice(0, maxSuggestions)
+  return scored.filter(s => s.score > 0).sort((a, b) => b.score - a.score)
     .map(s => s.path);
 }

[Survived] MethodExpression
src/schema-validator.js:178:10
     return { path: schemaPath, score };
   });
 
-  return scored
-    .filter(s => s.score > 0)
-    .sort((a, b) => b.score - a.score)
+  return scored.filter(s => s.score > 0)
     .slice(0, maxSuggestions)
     .map(s => s.path);

[Survived] ArrowFunction
src/schema-validator.js:179:13
   });
 
   return scored
-    .filter(s => s.score > 0)
+    .filter(() => undefined)
     .sort((a, b) => b.score - a.score)
     .slice(0, maxSuggestions)

[Survived] EqualityOperator
src/schema-validator.js:179:18
   });
 
   return scored
-    .filter(s => s.score > 0)
+    .filter(s => s.score <= 0)
     .sort((a, b) => b.score - a.score)
     .slice(0, maxSuggestions)

[Survived] ArrowFunction
src/schema-validator.js:180:11
 
   return scored
     .filter(s => s.score > 0)
-    .sort((a, b) => b.score - a.score)
+    .sort(() => undefined)
     .slice(0, maxSuggestions)
     .map(s => s.path);

[NoCoverage] ArithmeticOperator
src/schema-validator.js:180:21
 
   return scored
     .filter(s => s.score > 0)
-    .sort((a, b) => b.score - a.score)
+    .sort((a, b) => b.score + a.score)
     .slice(0, maxSuggestions)
     .map(s => s.path);

[Survived] ArrowFunction
src/schema-validator.js:182:10
     .filter(s => s.score > 0)
     .sort((a, b) => b.score - a.score)
     .slice(0, maxSuggestions)
-    .map(s => s.path);
+    .map(() => undefined);
 }
 

[Killed] BlockStatement
src/schema-validator.js:188:50
 /**
  * Extract all paths from schema
  */
-function extractSchemaPaths(schema, prefix = '') {
-  const paths = [];
-  const props = schema.properties || schema;
-
-  if (props && typeof props === 'object') {
-    for (const [key, value] of Object.entries(props)) {
-      const path = prefix ? `${prefix}.${key}` : key;
-      paths.push(path);
-
-      if (value && value.properties) {
-        paths.push(...extractSchemaPaths(value, path));
-      }
-    }
-  }
-
-  return paths;
-}
+function extractSchemaPaths(schema, prefix = '') {}
 
 /**
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases should detect non-existent paths and suggest alternatives
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] ConditionalExpression
src/schema-validator.js:190:17
  */
 function extractSchemaPaths(schema, prefix = '') {
   const paths = [];
-  const props = schema.properties || schema;
+  const props = false;
 
   if (props && typeof props === 'object') {

[Survived] ConditionalExpression
src/schema-validator.js:190:17
  */
 function extractSchemaPaths(schema, prefix = '') {
   const paths = [];
-  const props = schema.properties || schema;
+  const props = true;
 
   if (props && typeof props === 'object') {

[Survived] ConditionalExpression
src/schema-validator.js:192:16
   const paths = [];
   const props = schema.properties || schema;
 
-  if (props && typeof props === 'object') {
+  if (props && true) {
     for (const [key, value] of Object.entries(props)) {
       const path = prefix ? `${prefix}.${key}` : key;

[Survived] EqualityOperator
src/schema-validator.js:192:16
   const paths = [];
   const props = schema.properties || schema;
 
-  if (props && typeof props === 'object') {
+  if (props && typeof props !== 'object') {
     for (const [key, value] of Object.entries(props)) {
       const path = prefix ? `${prefix}.${key}` : key;

[Survived] BlockStatement
src/schema-validator.js:193:55
   const props = schema.properties || schema;
 
   if (props && typeof props === 'object') {
-    for (const [key, value] of Object.entries(props)) {
-      const path = prefix ? `${prefix}.${key}` : key;
-      paths.push(path);
-
-      if (value && value.properties) {
-        paths.push(...extractSchemaPaths(value, path));
-      }
-    }
+    for (const [key, value] of Object.entries(props)) {}
   }
 

[Survived] ConditionalExpression
src/schema-validator.js:197:11
       const path = prefix ? `${prefix}.${key}` : key;
       paths.push(path);
 
-      if (value && value.properties) {
+      if (false) {
         paths.push(...extractSchemaPaths(value, path));
       }

[Survived] ConditionalExpression
src/schema-validator.js:197:11
       const path = prefix ? `${prefix}.${key}` : key;
       paths.push(path);
 
-      if (value && value.properties) {
+      if (true) {
         paths.push(...extractSchemaPaths(value, path));
       }

[Survived] BlockStatement
src/schema-validator.js:213:36
   let count = 0;
   const minLen = Math.min(arr1.length, arr2.length);
 
-  for (let i = 0; i < minLen; i++) {
-    if (arr1[i] === arr2[i]) count++;
-    else break;
-  }
+  for (let i = 0; i < minLen; i++) {}
 
   return count;

[Survived] ConditionalExpression
src/schema-validator.js:214:9
   const minLen = Math.min(arr1.length, arr2.length);
 
   for (let i = 0; i < minLen; i++) {
-    if (arr1[i] === arr2[i]) count++;
+    if (true) count++;
     else break;
   }

[Killed] BlockStatement
src/schema-validator.js:228:22
   const expectedType = schemaNode.type;
   const actualType = getValueType(value);
 
-  if (!expectedType) {
-    return { valid: true };
-  }
+  if (!expectedType) {}
 
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Schema Structure Variations should handle schema with missing type definitions
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/schema-validator.js:232:70
     return { valid: true };
   }
 
-  const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
+  const expectedTypes = Array.isArray(expectedType) ? expectedType : [];
 
   if (!expectedTypes.includes(actualType)) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:234:44
 
   const expectedTypes = Array.isArray(expectedType) ? expectedType : [expectedType];
 
-  if (!expectedTypes.includes(actualType)) {
-    if (value === null && expectedTypes.includes('null')) {
-      return { valid: true };
-    }
-
-    return {
-      valid: false,
-      error: `Type mismatch`,
-      expectedType: expectedTypes.join(' or '),
-      actualType,
-      fix: `Change value to type: ${expectedTypes.join(' or ')}`
-    };
-  }
+  if (!expectedTypes.includes(actualType)) {}
 
   return { valid: true };
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Validation Edge Cases QUIRK: type mismatch when object provided for string field
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:255:7
  * Get JavaScript type
  */
 function getValueType(value) {
-  if (value === null) return 'null';
+  if (value !== null) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/schema-validator.js:258:7
   if (value === null) return 'null';
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
-  if (typeof value === 'number') return 'number';
+  if (typeof value !== 'number') return 'number';
   if (typeof value === 'string') return 'string';
   if (typeof value === 'object') return 'object';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:259:7
   if (Array.isArray(value)) return 'array';
   if (typeof value === 'boolean') return 'boolean';
   if (typeof value === 'number') return 'number';
-  if (typeof value === 'string') return 'string';
+  if (true) return 'string';
   if (typeof value === 'object') return 'object';
   return 'unknown';
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/schema-validator.js:268:39
  * Validate enum constraints
  */
 function validateEnum(value, allowedValues, path) {
-  if (!allowedValues.includes(value)) {
-    return {
-      valid: false,
-      error: `Value '${value}' not in allowed values: ${allowedValues.join(', ')}`
-    };
-  }
+  if (!allowedValues.includes(value)) {}
 
   return { valid: true };
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Enum Validation Edge Cases should be case-sensitive for enum values
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/schema-validator.js:271:76
   if (!allowedValues.includes(value)) {
     return {
       valid: false,
-      error: `Value '${value}' not in allowed values: ${allowedValues.join(', ')}`
+      error: `Value '${value}' not in allowed values: ${allowedValues.join("")}`
     };
   }

[Killed] EqualityOperator
src/schema-validator.js:289:9
     const distros = userConfig.controlPlane.distro;
     const enabled = [];
 
-    if (distros.k3s?.enabled === true) enabled.push('k3s');
+    if (distros.k3s?.enabled !== true) enabled.push('k3s');
     if (distros.k8s?.enabled === true) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/schema-validator.js:290:9
     const enabled = [];
 
     if (distros.k3s?.enabled === true) enabled.push('k3s');
-    if (distros.k8s?.enabled === true) enabled.push('k8s');
+    if (false) enabled.push('k8s');
     if (distros.k0s?.enabled === true) enabled.push('k0s');
     if (distros.eks?.enabled === true) enabled.push('eks');
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/schema-validator.js:299:16
         issue: 'Multiple distros enabled',
         severity: 'error',
         conflicting_paths: enabled.map(d => `controlPlane.distro.${d}.enabled: true`),
-        error: 'Only one distro can be enabled at a time',
+        error: "",
         fix: `Set only one distro to enabled: true. Currently: ${enabled.join(', ')}`
       });
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Conflict Detection should detect multiple distros enabled (vCluster-specific quirk)
statusReason: expected '' to contain 'Only one distro'

[Survived] StringLiteral
src/schema-validator.js:300:79
         severity: 'error',
         conflicting_paths: enabled.map(d => `controlPlane.distro.${d}.enabled: true`),
         error: 'Only one distro can be enabled at a time',
-        fix: `Set only one distro to enabled: true. Currently: ${enabled.join(', ')}`
+        fix: `Set only one distro to enabled: true. Currently: ${enabled.join("")}`
       });
     }

[Killed] ConditionalExpression
src/schema-validator.js:313:20
  */
 function checkRequiredFields(userConfig, schema) {
   const errors = [];
-  const required = schema.required || [];
+  const required = true;
 
   for (const field of required) {
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Path Extraction with Nested Structures should handle deeply nested objects without stackoverflow
statusReason: required is not iterable

[Killed] BooleanLiteral
src/schema-validator.js:316:9
   const required = schema.required || [];
 
   for (const field of required) {
-    if (!(field in userConfig)) {
+    if (field in userConfig) {
       errors.push({
         path: field,
killedBy: schema-validator.js - Edge Cases and Quirks QUIRK: Required Fields Validation should detect missing required fields
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/schema-validator.js:337:7
   const contextErrorCount = contextErrors.length;
   const totalIssues = errorCount + contextErrorCount;
 
-  if (deploySafe) {
+  if (false) {
     return {
       deploy_safe: true,
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate deploy_safe summary when no errors
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/schema-validator.js:338:12
   const totalIssues = errorCount + contextErrorCount;
 
   if (deploySafe) {
-    return {
-      deploy_safe: true,
-      message: 'Configuration is valid and safe to deploy',
-      total_errors: 0
-    };
+    return {};
   }
 
killedBy: schema-validator.js - Edge Cases and Quirks EDGE CASE: Summary Generation should generate deploy_safe summary when no errors
statusReason: expected undefined to be true // Object.is equality
